In [8]:
import mysql.connector                      #sql is used for database and this code is used for python
database = mysql.connector.connect(
    host="localhost",
    user="root",
    password="",
    database="class4pm"
)

db = database.cursor()

In [ ]:
#Insertion

In [6]:
sql= "INSERT INTO students(name,roll,physics,chemistry,math,english,nepali,total,per) VALUES('sita',22,56,78,89,55,67,465,75)"
db.execute(sql)
database.commit()

In [7]:
sql= "INSERT INTO students(name,roll,physics,chemistry,math,english,nepali,total,per) VALUES('Radha',22,56,78,89,55,67,465,75)"
db.execute(sql)
database.commit()

In [ ]:
n = int(input("enter n="))
for i in range(n):
    name = input("enter name=")
    roll = int(input("enter roll"))
    physics = int(input("enter physics="))
    chemistry = int(input("enter chemistry="))
    math = int(input("enter math="))
    english = int(input("enter english="))
    nepali = int(input("enter nepali="))
    total = physics+chemistry+math+english+nepali
    per = total/5
    sql = f"INSERT INTO students(name,roll,physics,chemistry,math,english,nepali,total,per) VALUES('{name}',{roll},{physics},{chemistry},{math},{english},{nepali},{total},{per})"
    db.execute(sql)
database.commit()

In [ ]:
#Select Query

In [ ]:
db.execute("SELECT * FROM students")

result =db.fetchall()
for x in result:
    print(x)

In [2]:
db.execute("SELECT sn,name,roll,total,per FROM students ")

result =db.fetchall()
for x in result:
    print(x)

(1, 'Ram', 22, 458, 78)
(3, 'sita', 22, 465, 75)
(4, 'radhaa', 22, 465, 75)
(5, 'hari', 33, 354, 71)
(6, 'hari', 33, 363, 73)
(7, 'shyam', 45, 332, 66)
(8, 'sita', 22, 465, 75)

In [3]:
db.execute("SELECt * FROM students WHERE per>75")

result =db.fetchall()
for x in result:
    print(x)

(1, 'Ram', 22, 55, 78, 76, 77, 66, 458, 78)

In [ ]:
#UPDATE QUERY

In [2]:
sql = "UPDATE students SET name ='radhaa' WHERE sn =4"
db.execute(sql)
database.commit()

In [3]:
subject = input("enter subject(physics,chemistry,math,english,nepali)")
name = input("enter student name =")
db.execute(f" SELECT {subject} FROM students WHERE name = name")
result = db.fetchall()
print(result)

enter subject(physics,chemistry,math,english,nepali)physics
enter student name=sita
[(55,), (56,), (56,), (56,), (78,), (67,), (56,)]

In [5]:
subject = input("enter subject(physics,chemistry,math,english,nepali")
name = input("enter student name=")
db.execute(f" SELECT {subject} FROM students WHERE name = '{name}'")
result = db.fetchall()
print(result)

enter subject(physics,chemistry,math,english,nepaliphysics
enter student name=sita
[(56,), (56,)]

In [6]:
subject = input("enter subject(physics,chemistry,math,english,nepali")
name = input("enter student name=")
db.execute(f" SELECT {subject} FROM students WHERE name = '{name}'")
result = db.fetchall()[0][0]
print(result)

enter subject(physics,chemistry,math,english,nepaliphysics
enter student name=sita
56

In [8]:
subject = input("enter subject(physics,chemistry,math,english,nepali")          #new_marks will be updated
name = input("enter student name=")
db.execute(f" SELECT {subject} FROM students WHERE name = '{name}'")
result = db.fetchall()[0][0]
print(result)

new_marks = int(input("enter new_marks ="))

sql=f"UPDATE students SET physics = {new_marks} WHERE name = '{name}'"
db.execute(sql)
database.commit()

enter subject(physics,chemistry,math,english,nepaliphysics
enter student name=sita
56
enter new_marks =67

In [9]:
subject = input("enter subject(physics,chemistry,math,english,nepali")
name = input("enter student name=")
db.execute(f" SELECT {subject},total FROM students WHERE name = '{name}'")
result = db.fetchall()
print(result)

enter subject(physics,chemistry,math,english,nepaliphysics
enter student name=sita
[(67, 465), (67, 465)]

In [2]:
subject = input("enter subject(physics,chemistry,math,english,nepali")
name = input("enter student name=")
db.execute(f" SELECT {subject},total FROM students WHERE name = '{name}'")
result = db.fetchall()

print(result)

enter subject(physics,chemistry,math,english,nepaliphysics
enter student name=sita
[(67, 465), (67, 465)]

In [6]:
n= int(input("enter n="))
for i in range(n):
    subject = input("enter subject(physics,chemistry,math,english,nepali)")                #new marks,total,per are calculated and updated
    name = input("enter student name =")
    db.execute(f" SELECT {subject}, total FROM students WHERE name = '{name}'")
    result = db.fetchall()
    print(result)

    marks = result[0][1]
    total = result[0][1]


    new_marks = int(input("enter new marks ="))
    resultant_marks = new_marks-marks
    total =resultant_marks+total
    per = total/5

    sql = f"UPDATE students SET physics ={new_marks}, total = {total}, per = {per} WHERE name ='{name}'"
    db.execute(sql)
database.commit()

enter n=2
enter subject(physics,chemistry,math,english,nepali)physics
enter student name =radhaa
[(78, 78)]
enter new marks =99
enter subject(physics,chemistry,math,english,nepali)chemistry
enter student name =radhaa
[(78, 99)]
enter new marks =88

In [3]:
#DELETE QUERY

In [11]:
name = input("enter name =")
sql = f"DELETE FROM students WHERE name ='{name}'"
db.execute(sql)
database.commit()

enter name =sita

In [13]:
name = input("enter name =")

sql = f"DELETE FROM students WHERE name ='{name}'"
db.execute(sql)
database.commit()

enter name =hari